Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: Can you come and get me?
hi: क्या तुम मुझे लेने आ सकते हो?

source: When's Tom coming back?
hi: टॉम कब लौट आ रहा है?

source: Tom pulled Mary's hair.
hi: टॉम ने मैरी के बाल खीचें।

source: I don't have a lover.
hi: मेरा कोई प्रेमी नहीं है।

source: Don't worry. Tom will take care of it.
hi: चिंता मत करो। टॉम देख लेगा।

source: It's written in Geeta: Fulfill your duties, without the desire of its fruit.
hi: गीता में लिखा है: कर्म करे जा, फल की इच्छा न कर।

source: My father is my biggest source of inspiration.
hi: मेरे पिताजी मेरे सबसे बड़े प्रेरणा के स्रोत हैं।

source: When will the snow melt?
hi: बरफ कब पिघलेगी?

source: I ask forgiveness.
hi: मैं माफी चाहती हूँ

source: I am sorry.
hi: मैं माफी चाहती हूँ

source: You are welcome!
hi: आपका स्वागत हैं।

source: I am looking for John.
hi: मैं जोन को ढुँढ रहा हुँ ।

source: Russia is bigger than Italy.
hi: रूस इटली से बड़ा है।

source: Is this Bob's book?
hi: यह बॉब की किताब है?

source: My brother's guitar is new.
hi: मेरे भाई की गिटार नई है।

source: How did Tom do this?
hi: टॉम ने यह कैसे किया?

source: Why's Tom like that?
hi: टॉम वैसे क्यों है?

source: You can't stay here tonight.
hi: तुम आज रात यहाँ नहीं रह सकते।

source: Pluto is not alone. It has a friend named Charon.
hi: प्लूटो अकेला नहीं है। उसका कैरन नाम का एक दोस्त है।

source: We eat rice.
hi: हम चावल खाते हैं।

source: I eat pasta.
hi: मैं पास्ता खाता हूँ।

source: She's cooking now.
hi: वह अभी खाना पका रही है।

source: It can't happen now.
hi: अभी नहीं हो सकता।

source: It hasn't happened yet.
hi: अभी तक हुआ नहीं है।

source: We'll see what happens.
hi: देखते हैं क्या होता है।

source: Well, what's happening?
hi: तो? क्या हो रहा है?

source: What's happened to Tom?
hi: टॉम को क्या हुआ है?

source: What's happened to you?
hi: तुम्हें क्या हुआ है?

source: What's happening to me?
hi: मुझे क्या हो रहा है?

source: What's happening to us?
hi: हमें क्या हो रहा है?

source: Tom has a pet monkey named Cookie.
hi: टॉम के पास "कुकी" नाम का एक पालतू बंदर है।

source: Tom has a pet monkey named Coconut.
hi: टॉम के पास कोकोनट नाम का एक पालतू बंदर है।

source: What's going to happen tonight?
hi: आज रात क्या होने वाला है?

source: Something has happened to Tom.
hi: टॉम को कुछ हो गया है।

source: I was born in the Soviet Union.
hi: मेरा जन्म सोवियत संघ में हुआ।

source: They are very important.
hi: वे बहुत महत्त्वपूर्ण हैं।

source: What happened in Boston wasn't your fault.
hi: बॉस्टन में जो हुआ वह तुम्हारी गलती नहीं थी।

source: The horse is black.
hi: घोड़ा काला है।

source: I want to drink tea.
hi: मैं चाय पीना चाहता हूँ।

source: These are good questions.
hi: ये अच्छे सवाल हैं।

source: It was Tom that asked the question.
hi: सवाल पूँछा था टॉम ने।

source: It was Tom who asked the question.
hi: सवाल पूँछा था टॉम ने।

source: Do you want to go somewhere?
hi: आपको कहीं जाना है?

source: The price has gone up.
hi: दाम बढ़ गया है।

source: Selene is the goddess of the moon.
hi: सेलीन चाँद की देवी है।

source: Russia wasn't capitalist.
hi: रूस पूँजीवादी नहीं था।

source: Russia became communist.
hi: रूस साम्यवादी हो गया।

source: America rules the world.
hi: अमरीका दुनिया पर राज करता है।

source: Tom bought it.
hi: टॉम ने खरीद लिया।

source: You can't buy that kind of loyalty.
hi: ऐसी वफ़ादारी खरीदी नहीं जा सकती।

source: His sister is very beautiful.
hi: उसकी बहन बहुत सुंदर है।

source: What's Tom given us?
hi: टॉम ने हमें क्या दिया है?

source: What'll you give me?
hi: तुम मुझे क्या दोगे?

source: We're not giving up.
hi: हम हार नहीं मान रहें।

source: Just give the order.
hi: बस हुक्म दीजिए।

source: Give Tom a chair.
hi: टॉम को एक कुर्सी दो।

source: Give me more time.
hi: मुझे और वक़्त दो।

source: Give me a job.
hi: मुझे नौकरी दो।

source: Give me a gun.
hi: मुझे एक बंदूक दो।

source: Give me a good one.
hi: कोई अच्छा वाला देना।

source: Give me a day.
hi: मुझे एक दिन दीजिए।

source: I don't know Russian yet.
hi: मुझे अभी तक रूसी नहीं आती।

source: This place gives me the creeps.
hi: यह स्थान मुझे बेहद भयानक लगता है |

source: We've been given a second chance.
hi: हमें एक दूसरा मौका दिया गया है।

source: Can you give Tom another chance?
hi: क्या तुम टॉम को और एक मौका दे सकते हो?

source: What are we going to eat?
hi: हम क्या खाने वाले हैं?

source: His money is in the bank.
hi: उसके पैसे बैंक में हैं।

source: She is my father's mother. She is my paternal grandmother.
hi: वह मेरे पिताजी की माँ है। वह मेरी दादी है।

source: The girls work.
hi: लकड़ियाँ काम करती हैं।

source: Pua sings.
hi: पुआ गाती है।

source: Tom is drinking tea.
hi: टॉम चाय पी रहा है।

source: Why doesn't Tom help you?
hi: टॉम तुम्हारी मदद क्यों नहीं करता?

source: Why does Tom want to help Mary?
hi: टॉम मैरी की मदद क्यों करना चाहता है?

source: Who's helping you?
hi: तुम्हारी मदद कौन कर रहा है?

source: Who's going to help me?
hi: मेरी मदद कौन करने वाला है?

source: We've come to help.
hi: हम मदद करने आए हैं।

source: We can't help you.
hi: हम तुम्हारी मदद नहीं कर सकते।

source: Tom would've helped us.
hi: टॉम ने हमारी मदद की होती।

source: Tom is going to help Mary.
hi: टॉम मैरी की मदद करने वाला है।

source: Tom couldn't help but cry.
hi: टॉम खुद को रोने से रोक न सका।

source: Let's help Tom.
hi: टॉम की मदद करते हैं।

source: Did you help Tom?
hi: क्या तुमने टॉम की मदद की?

source: That's my secret.
hi: वही मेरा राज़ है।

source: I know Tom's secret.
hi: मैं टॉम का राज़ जानता हूँ।

source: Tom has one, too.
hi: टॉम के पास भी एक है।

source: One of them is lying.
hi: उनमें से एक झूठ बोल रहा है।

source: This one's old.
hi: यह वाला बहुत पुराना है।

source: This one's nice.
hi: यह वाला अच्छा है।

source: This one's for me.
hi: यह वाला मेरे लिये है।

source: There's only one door.
hi: बस एक ही दरवाज़ा है।

source: That's an easy one.
hi: वह वाला आसान है।

source: That one's good.
hi: वह वाला अच्छा है।

source: Here, this one's yours.
hi: लो, यह वाला तुम्हारा।

source: I want to know why Tom is doing this.
hi: मुझे यह बताओ, कि टॉम ऐसा कर क्यों रहा है।

source: Tom's lips are blue.
hi: टॉम के होंठ नीले हैं।

source: Tom's face got red.
hi: टॉम का चेहरा लाल हो गया।

source: Tom's eyes are red today.
hi: टॉम की आँखें आज लाल हैं।

source: Tom was dressed in blue.
hi: टॉम ने नीले कपड़े पहन रखे थे।

source: Tom has red hair.
hi: टॉम के पास लाल बाल हैं।

source: Tom had white shoes on.
hi: टॉम ने सफ़ेद जूते पहने थे।

source: Tom always wears black.
hi: टॉम हमेशा काले कपड़े पहनता है।

source: You won't like Tom.
hi: तुम्हें टॉम पसंद नहीं आएगा।

source: You ask too many questions.
hi: तुम कुछ ज़्यादा ही सवाल पूछते हो।

source: Who sent Tom?
hi: टॉम को किसने भेजा?

source: We've only got three minutes.
hi: हमारे पास तो बस तीन ही मिनट हैं।

source: We took a cab.
hi: हमने एक टैक्सी ली।

source: Was Tom crying?
hi: क्या टॉम रो रहा था?

source: Tom's very sad.
hi: टॉम बहुत उदास है।

source: Tom's not sick.
hi: टॉब बीमार नहीं है।

source: Tom's not home.
hi: टॉम घर पर नहीं है।

source: Tom's not fat.
hi: टॉम मोटा नहीं है।

source: Tom worked hard.
hi: टॉम ने मेहनत की।

source: Tom won't bite.
hi: टॉम काटेगा नहीं।

source: Tom wasn't wearing a hat.
hi: टॉम ने टोपी नहीं पहनी थी।

source: Tom wasn't sick.
hi: टॉम बीमार नहीं था।

source: Tom was timid.
hi: टॉम डरपोक था।

source: Tom was thirsty.
hi: टॉम को प्यास लगी थी।

source: Tom was sharp.
hi: टॉम तेज़ था।

source: Tom was greedy.
hi: टॉम लालची था।

source: Tom was eager.
hi: टॉम उत्सुक था।

source: Tom was cruel.
hi: टॉम निर्दयी था।

source: Tom was brave.
hi: टॉम बहादुर था।

source: Tom turned 13.
hi: टॉम १३ साल का हो गया।

source: Tom shot a gun.
hi: टॉम ने एक बंदूक चलाई।

source: Tom seems sad.
hi: टॉम उदास लगता है।

source: Tom seems old.
hi: टॉम बूढ़ा लगता है।

source: Tom runs fast.
hi: टॉम तेज दौड़ता है।

source: Tom made rice.
hi: टॉम ने चावल बनाया।

source: Tom made it.
hi: टॉम ने बनाया।

source: Tom let us go.
hi: टॉम ने हमें छोड़ दिया।

source: Tom left home.
hi: टॉम घर छोड़ कर चला गया।

source: Tom knows a lot.
hi: टॉम को बहुत कुछ पता है।

source: Tom isn't young.
hi: टॉम जवान नहीं है।

source: Tom isn't weak.
hi: टॉम कमज़ोर नहीं है।

source: Tom isn't ugly.
hi: टॉम बदसूरत नहीं है।

source: Tom isn't timid.
hi: टॉम डरपोक नहीं है।

source: Tom isn't thin.
hi: टॉम पतला नहीं है।

source: Tom isn't poor.
hi: टॉम गरीब नहीं है।

source: Tom isn't nice.
hi: टॉम अच्छा नहीं है।

source: Tom isn't lazy.
hi: टॉम आलसी नहीं है।

source: Tom isn't cruel.
hi: टॉम क्रूर नहीं है।

source: Tom is my uncle.
hi: टॉम मेरा मामा है।

source: Tom is my age.
hi: टॉम मेरी उमर का है।

source: Tom is homeless.
hi: टॉम बेघर है।

source: Tom is deaf.
hi: टॉम बहरा है।

source: Tom is alone.
hi: टॉम अकेला है।

source: Tom hit Mary.
hi: टॉमने मैरी को मारा।

source: Tom helps us.
hi: टॉम हमारी मदद करता है।

source: Tom gave Mary a watch.
hi: टॉम ने मैरी को एक घड़ी दी।

source: I got hit.
hi: मुझे लगी।

source: I didn't recognize Tom.
hi: मैंने टॉम को पहचाना नहीं।

source: How late am I?
hi: मुझे कितनी देर हुई है?

source: Go and tell Tom.
hi: जा कर टॉम को बताओ।

source: Don't encourage Tom.
hi: टॉम को बढ़ावा मत दो।

source: Do as Tom says.
hi: टॉम जैसा कहे वैसा करो।

source: Did Tom vote?
hi: टॉम ने मतदान किया?

source: Are you safe?
hi: क्या तुम सुरक्षित हो?

source: It will only take a few minutes.
hi: बस कुछ ही मिनट लगेंगे।

source: Millie is eating a banana.
hi: मिली केला खा रही है।

source: Is love more important than friendship?
hi: क्या प्यार दोस्ती से ज़्यादा महत्त्वपूर्ण है?

source: Ukraine is a big country.
hi: युक्रेन बड़ा देश है।

source: Just let me sleep.
hi: मुझे बस सोने दो।

source: We should work now.
hi: हमें अभी काम करना चाहिए।

source: There must be more.
hi: और होगा।

source: It must've been stolen.
hi: चुराया गया होगा।

source: It must've been fun.
hi: मज़ा आया होगा।

source: It must be a virus.
hi: ज़रूर कोई वाइरस होगा.

source: It must be a mistake.
hi: कोई गलती हुई होगी।

source: It's midday.
hi: दोपहर हो गई है।

source: What are your thoughts about Japan's economy?
hi: जापान की अर्थव्यवस्था के बारे में आपके क्या विचार हैं?

source: We'll talk to Tom.
hi: टॉम से हम बात करेंगे।

source: Why can't Tom talk?
hi: टॉम क्यों नहीं बोल सकता?

source: We've talked to Tom.
hi: हमने टॉम से बात की है।

source: We're going to talk.
hi: हम बात करने वाले हैं।

source: Was I talking to you?
hi: क्या मैं तुमसे बात कर रहा था?

source: Tom only talks to me.
hi: टॉम बस मुझसे बात करता है।

source: Should I talk to Tom?
hi: क्या मुझे टॉम से बात कर लेनी चाहिए?

source: Can we talk with Tom?
hi: क्या हम टॉम से बात कर सकते हैं?

source: Can we talk tomorrow?
hi: क्या हम कल बात कर सकते हैं?

source: Who is Tom talking to?
hi: टॉम किससे बात कर रहा है?

source: We're just going to talk.
hi: हम बस बात करने वाले हैं।

source: Tom can't talk to us yet.
hi: टॉम अभी हम से बात नहीं कर सकता।

source: Tom can't talk right now.
hi: टॉम इस वक़्त बात नहीं कर सकता।

source: Let me talk to Tom first.
hi: पहले मुझे टॉम से बात करने दो।

source: Why are you talking to me?
hi: मुझसे बात क्यों कर रहे हो?

source: We'll need to talk to Tom.
hi: हमें टॉम से बात करनी पड़ेगी।

source: It's a big company.
hi: बड़ी कंपनी है।

source: I think Tom is weak.
hi: मुझे लगता है टॉम कमज़ोर है।

source: Where is the bar?
hi: बार कहाँ है?

source: Where is the beach?
hi: समुद्र तट कहां है?

source: I think we're lost.
hi: मुझे लगता है हम खो गये हैं।

source: Stay inside.
hi: अंदर रहना।

source: You may stay.
hi: तुम रह सकते हो।

source: Stay close to me.
hi: मेरे पास रहो।

source: I knew you'd stay.
hi: मैं जानता था तुम रहोगे।

source: Tom can't stay here.
hi: टॉम यहाँ नहीं रह सकता।

source: We'll stay with Tom.
hi: हम टॉम के साथ रहेंगे।

source: You'll stay with me.
hi: तुम मेरे साथ रहोगे।

source: Tom will stay with us.
hi: टॉम हमारे साथ रहेगा।

source: We're staying with you.
hi: हम तुम्हारे साथ रह रहे है।

source: I'll stay away from you.
hi: मैं तुम से दूर रहूँगा।

source: Stay away from the door.
hi: दरवाज़े से दूर रहना।

source: Tell Tom I'm sick.
hi: टॉम को बताना मैं बीमार हूँ।

source: Tom can't be sick.
hi: टॉम बीमार नहीं हो सकता।

source: We know you're sick.
hi: हम जानते हैं तुम बीमार हो।

source: Do you hate me?
hi: क्या तुम मुझ से नफरत करते हो?

source: Your cat is black.
hi: तुम्हारी बिल्ली काली है।

source: This is impossible for me.
hi: यह मेरे लिये ना-मुमकिन है।

source: That was Portugal.
hi: वह पुर्तगाल था।

source: How was the audition?
hi: ऑडिशन कैसा रहा?

source: Tell me who won.
hi: कौन जीता बताओ।

source: Tell me a story.
hi: मुझे एक कहानी सुनाओ।

source: Let me tell Tom.
hi: टॉम को मुझे बताने दो।

source: Tell me his name.
hi: मुझे उसका नाम बताओ।

source: Tell me your plan.
hi: मुझे तुम्हारी योजना बताओ।

source: What do I tell Tom?
hi: मैं टॉम को क्या बताऊँ?

source: Tell me where I am.
hi: मुझे बताओ में कहाँ हूँ।

source: Do like I tell you.
hi: मैं जैसे कहूँ वैसे करो।

source: What do we tell Tom?
hi: हम टॉम को क्या बताएं?

source: What did I tell you?
hi: मैंने तुम्हें क्या बताया?

source: What can I tell Tom?
hi: मैं टॉम को क्या बता सकती हूँ?

source: We have to tell Tom.
hi: हमें टॉम को बताना चाहिए।

source: Tell Tom we're here.
hi: टॉम को बताना हम यहाँ हैं।

source: I can't tell anyone.
hi: मैं किसी को नहीं बता सकता।

source: Why did Tom tell you?
hi: टॉम ने तुम्हें क्यों बताया?

source: What will I tell Tom?
hi: मैं टॉम को क्या बताउँगा?

source: What did he tell you?
hi: उसने तुम्हें क्या बताया?

source: What can you tell us?
hi: आप हमें क्या बता सकते हैं?

source: What can you tell me?
hi: आप मुझे क्या बता सकते हैं?

source: Tom told Mary to lie.
hi: टॉम ने मेरी को झूठ बोलने कहाँ।

source: Tell us where Tom is.
hi: हमें बताओ टॉम कहाँ है।

source: Tell them who we are.
hi: उन्हें बताओ हम कौन है।

source: Tell me your address.
hi: तुम्हारा पता बताओ।

source: Tell me who did this.
hi: यह किसने किया मुझे बताओ।

source: Why can't you tell me?
hi: तुम मुझे क्यों नहीं बता सकते?

source: Who told you all that?
hi: तुम्हें वह सब किसने बताया?

source: Who told you about us?
hi: तुम्हें हमारे बारे में किसने बताया?

source: When did you tell Tom?
hi: तुमने टॉम को कब बताया?

source: When did Tom tell you?
hi: टॉम ने तुम्हें कब बताया?

source: What did Tom tell you?
hi: टॉम ने तुम्हें क्या बताया?

source: We can tell Tom later.
hi: हम टॉम को बाद में बता सकते हैं।

source: Tom told us about you.
hi: टॉम ने हमें तुम्हारे बारे में बताया।

source: Tom told me about you.
hi: टॉम ने मुझे तुम्हारे बारे में बताया।

source: Just tell me her name.
hi: मुझे बस उसका नाम बताओ।

source: I'm not going to tell.
hi: मैं नहीं बताने वाला।

source: I tell you everything.
hi: मैं तुम्हें सब कुछ बताता हूँ।

source: Who told you about Tom?
hi: तुम्हें टॉम के बारे में किसने बताया?

source: What will you tell Tom?
hi: तुम टॉम को क्या बताओगे?

source: What should I tell Tom?
hi: मैं टॉम को क्या बताऊँ?

source: What did Tom tell Mary?
hi: टॉम ने मैरी को क्या बताया?

source: Tell me your real name.
hi: मुझे अपना असली नाम बताओ।

source: That's what you told me.
hi: वही तो तुम ने मुझे बताया था।

source: Why didn't Tom tell Mary?
hi: टॉम ने मैरी को क्यों नहीं बताया?

source: Why couldn't you tell me?
hi: तुम मुझे क्यों नहीं बता सके?

source: Why haven't you told Tom yet?
hi: तुम ने अभी तक टॉम को क्यों नहीं बताया है?

source: You should've told me that yesterday.
hi: तुम ने मुझे वह कल बताना चाहिए था।

source: In America, you can always find a party. In Soviet Russia, the Party can always find you!
hi: अमरीका में तो आपको पार्टी कहीं भी मिल जाएगी। मगर सोवियत रूस में पार्टी को आप कहीं भी मिल जाएंगे!

source: We are not rich.
hi: हम अमीर नहीं हैं।

source: That old woman smiled at her granddaughter.
hi: वह बूढ़ी औरत अपनी पोती पर मुस्कुराई।

source: Is it fine if I explain in English? Anyone who wouldn't be comfortable with English, please raise your hand.
hi: अंग्रेज़ी में समझाया तो चलेगा क्या? जिन्हें अंग्रेज़ी से तकलीफ़ है वो हाथ उठाएँ।

source: The Prime Minister resigned yesterday.
hi: प्रधानमंत्री ने कल इस्तीफ़ा दे दिया।

source: Mary is a kindergarten teacher.
hi: मेरी नर्सरी टीचर है।

source: It is my father's house.
hi: मेरे पिताजी का घर है।

source: I want to go to India.
hi: मैं भारत जाना चाहता हूँ।

source: I showed the ticket at the gate.
hi: मैंने दरवाज़े पर टिकट दिखाया।

source: Susan is older than me by 2 years.
hi: सूज़ैन मुझसे दो साल बड़ी है।

source: Due to the rain, staying at home would be a better option.
hi: बारिश हो रही है, इसलिए अभी घर में रहना ही अच्छा रहेगा।

source: Jørgen is learning Greek.
hi: यॉर्गेन यूनानी सीख रहा है।

source: My elder sister is good at playing the guitar.
hi: मेरी बड़ी बहन गिटार अच्छा बजाती है।

source: He respected Mr. Hayakawa.
hi: वे हायाकावा जी का सम्मान करते थे।

source: There is a garden behind my house.
hi: मेरे घर के पीछे एक बगीचा है।

source: Jim had stayed at my house.
hi: जिम मेरे घर में ठहरा था।

source: The German train drivers strike again.
hi: जर्मन ट्रेन चालक फिर से हड़ताल कर रहे हैं।

source: I am Spanish.
hi: मैं स्पेनी हूँ।

source: I am German.
hi: मैं जर्मन हूँ।

source: Where do I sit?
hi: मैं कहाँ बैठूं?

source: Here, sit down.
hi: यहाँ, बैठ जाओ।

source: Come, sit by me.
hi: आओ, मेरे पास बैठो।

source: Can we sit here?
hi: क्या हम यहाँ बैठ सकते हैं?

source: You can sit here.
hi: तुम यहाँ बैठ सकते हो।

source: Tom sat next to me.
hi: टॉम मेरी बगल में बैठ गया।

source: They both sat down.
hi: वे दोनों बैठ गए।

source: Just sit down, Tom.
hi: बस बैठ जाओ, टॉम।

source: Just sit and relax.
hi: बस बैठो और आराम करो।

source: Everybody sat down.
hi: सभी बैठ गए।

source: Can I sit with Tom?
hi: क्या मैं टॉम के साथ बैठ सकता हूँ?

source: You can't sit there.
hi: तुम वहाँ नहीं बैठ सकते।

source: Can I sit there?
hi: क्या मैं वहाँ बैठ सकता हूँ?

source: You can sit down now.
hi: तुम अभी बैठ सकते हो।

source: Who was sitting here?
hi: यहाँ कौन बैठा था?

source: Tom sat in front of me.
hi: टॉम मेरे सामने बैठा।

source: Tom wanted to sit next to Mary.
hi: टॉम मेरी के बगल में बैठना चाहता था।

source: Tom and Mary sat down together.
hi: टॉम और मैरी एक साथ नीचे बैठ गएं।

source: Why are you sitting in the dark?
hi: तुम अंधेरे में क्यों बैठे हो?

source: Tom and Mary are sitting together.
hi: टॉम और मैरी एक साथ बैठे हैं।

source: O Our Father in Heaven, Holy be your name, Your Kingdom come, Your will be done, on earth, as it is in heaven. Give us this day our daily bread, and forgive us our sins, as we also have forgiven our sinners. And lead us not into temptation, but deliver us from evil.
hi: हे हमारे स्वरगिक पिता, तेरा नाम पवित्र माना जाए, तेरा राज्य अाए, तेरी इच्छा जैसे स्वर्ग मे॑ पूरी होती है॑, वैसे पर्िथ्वी पर भी हो, आज हमे॑ उतना भोजन दे, जो हमारे लिए आवश्क है, हमारे अपराध शमा कर, जैसे हम दूसरो के अपराध शमा करते है, हमारे विश्वास को मत परख पर॑तु हमे शैतान से बचा.

source: Save me a donut.
hi: मेरे लिये एक डोनट बचा कर रखना।

source: Can you save Tom?
hi: क्या तुम टॉम को बचा सकते हो?

source: You can't save me.
hi: तुम मुझे नहीं बचा सकते।

source: We saved your life.
hi: हमने तुम्हारी जान बचाई।

source: Why do you hate me so much?
hi: तुम मुझ से इतनी नफ़रत क्यों करते हो?

source: Ahmedabad is the largest city in Gujarat.
hi: अहमदाबाद गुजरात का सबसे बड़ा शहर है।

source: I have been learning English for five years.
hi: मैं पाँच साल से अंग्रेज़ी सीख रहा हूँ।

source: I like people who use language beautifully.
hi: मुझे ऐसे लोग पसंद है जो सुंदरता से भाषा का प्रयोग करते हैं।

source: Niels Bohr was a Danish physicist.
hi: नील्स बोर एक डेनिश भौतिक विज्ञानी थे।

source: I brought my camera, of course.
hi: मैंने मेरा कैमरा तो लाया ही है।

source: Let's sit down here.
hi: यहाँ बैठ जाते है।

source: There are a thousand meters in a kilometer.
hi: एक किलोमीटर में एक हज़ार मीटर होते हैं।

source: Park the car in the shade.
hi: गाड़ी छाँव में पार्क करो।

source: Tom wants a new hat.
hi: टॉम को एक नयी टोपी चाहिए।

source: Does Mary love me?
hi: क्या मैरी मुझ से प्यार करती है?

source: I was born in China.
hi: मेरा जन्म चीन में हुआ था।

source: I want to learn Romanian.
hi: मैं रोमानियाई सीखना चाहता हूँ।

source: So how's it going in Egypt?
hi: तो, मिस्र में कैसा चल रहा है?

source: There's something down there.
hi: वहाँ नीचे कुछ है।

source: There's something under my bed.
hi: मेरे बिस्तर के नीचे कुछ है।

source: Osaka is larger than Kyoto.
hi: ओसाका क्योटो से बड़ा है।

source: Who do I live for?
hi: मैं किसके लिये जीता हूँ?

source: I ate an apple.
hi: मैंने एक सेब खाया।

source: I drink milk.
hi: मैं दूध पीता हूँ।

source: Tom, come here and sit with me.
hi: टॉम, यहाँ आओ और मेरे साथ बैठो।

source: How's your shoulder?
hi: तुम्हारा कंधा कैसा है?

source: We've both seen it.
hi: हम दोनों ने देखा है।

source: We've got another three days.
hi: हमारे पास और तीन दिन हैं।

source: We'll be back tonight.
hi: हम आज रात लौट आएंगे।

source: We'll come back tomorrow.
hi: हम कल लौटेंगे।

source: We'll have a great time.
hi: बड़े मज़े करेंगे।

source: We haven't even tried.
hi: हमने तो कोशिश भी नहीं की है।

source: We should help Tom.
hi: हमें टॉम की मदद करनी चाहिए।

source: We both saw Tom.
hi: टॉम को हम दोनों ने देखा।

source: We shouldn't do this.
hi: हमें ऐसा नहीं करना चाहिए।

source: We shouldn't do that.
hi: हमें वैसा नहीं करना चाहिए।

source: We were just studying.
hi: हम बस पढ़ाई कर रहे थे।

source: We think you're right.
hi: हमें लगता है तुम सही हो।

source: We can order a pizza.
hi: हम पिज़ा मंगा सकते हैं।

source: We threw Tom out.
hi: हमने टॉम को बाहर फेंक दिया।

source: We can help each other.
hi: हम एक-दूसरे की मदद कर सकते हैं।

source: We live together now.
hi: अभी हम एक साथ रहते हैं।

source: We can help Tom now.
hi: अभी हम टॉम की मदद कर सकते हैं।

source: We were there last night.
hi: हम कल रात वहाँ थे।

source: We won the lottery.
hi: हम लॉटरी जीते।

source: We all cried a lot.
hi: हम सब बहुत रोए।

source: We can't forget it.
hi: हम भूल नहीं सकते.

source: We can't leave Tom here.
hi: हम टॉम को यहाँ नहीं छोड़ सकते।

source: We don't know where we are.
hi: हमें नहीं पता हम कहाँ हैं।

source: It's a big world.
hi: बड़ी दुनिया है।

source: How big was your school?
hi: तुम्हारी स्कूल कितनी बड़ी थी?

source: How big is your school?
hi: तुम्हारी स्कूल कितनी बड़ी है?

source: It's a big room.
hi: बड़ा कमरा है।

source: It was a big night.
hi: बड़ी रात थी।

source: This is big news.
hi: यह बड़ी ख़बर है।

source: It's a big hospital.
hi: बड़ा अस्पताल है।

source: Soon enough, there were only three enormous countries on Terra.
hi: जल्दी ही, टेरा पर केवल तीन विशाल देश रह गये थे।

source: I am Tom.
hi: मैं टौम हूँ।

source: They are wrong.
hi: वे गलत हैं।

source: You know Tom.
hi: तुम टॉम को जानते हो।

source: Another empire is going to be destroyed.
hi: और एक साम्राज्य नष्ट होने वाला है।

source: Tom was shot in the leg.
hi: टॉम को पैर में गोली लगी।

source: Can I get you some tea?
hi: तुम्हारे लिये थोड़ी सी चाय लाऊँ?

source: This government is corrupt.
hi: यह सरकार भ्रष्ट है।

source: I should've gone with you.
hi: मुझे तुम्हारे साथ जाना चाहिए था।

source: I can't save you this time.
hi: मैं तुम्हें इस बार बचा नहीं सकता।

source: I was going to do it yesterday.
hi: मैं वह कल करने वाला था।

source: I wish Tom were here with us.
hi: काश टॉम यहाँ हमारे साथ होता।

source: I wasn't making fun of Tom.
hi: मैं टॉम का मज़ाक नहीं उड़ा रहा था।

source: I used to be like Tom.
hi: मैं टॉम जैसी होती थी।

source: I've done the right thing.
hi: मैंने सही चीज़ की है।

source: I've done the wrong thing.
hi: मैंने गलत चीज़ की है।

source: I'm not worried about that.
hi: मुझे उसकी चिंता नहीं है।

source: Ajay is poor.
hi: अजय गरीब है।

source: I had gone there.
hi: मैं वहाँ गई थी।

source: I got Tom to do it.
hi: मैंने टॉम से करवाया।

source: You proved me wrong.
hi: तुमने मुझे गलत साबित किया।

source: Do you speak Marathi?
hi: मराठी बोलते हो?

source: Indians know their country by many names: "Bharat" from Sanskrit, "Hindustan" from Persian and "India" from English.
hi: भारतीय लोग अपने देश को कई नामों से जानते हैं: संस्कृत से आया हुआ "भारत", फारसी से आया हुआ "हिंदुस्तान" और अंग्रेज़ी से आया हुआ "इंडिया"।

source: The most important sex organ is the brain.
hi: सबसे महत्त्वपूर्ण यौन अंग होता है दिमाग।
